x1=[ 
2002 76.90 82.00 78.67 80.29 80.25
2003 77.10 82.07 78.75 80.69 80.33
2004 77.50 82.36 79.34 81.04 81.19
2005 77.40 82.27 79.48 81.44 81.18
2006 77.70 82.68 79.81 81.63 81.59
2007 77.90 82.87 79.98 81.67 81.11
2008 77.80 82.81 80.06 81.57 81.24
2009 78.35 82.93 80.05 81.94 81.75
2010 78.51 83.09 80.23 82.09 81.92
2012 78.80 83.42 80.58 82.36 82.24
 ];%国民年限
x2=[
2001 66.00 62.10 58.10 63.50 47.90
2002 65.60 61.40 57.80 63.50 48.40
2003 65.20 61.00 57.30 63.60 48.80
2004 64.90 60.60 57.80 63.50 49.50
2005 65.00 60.50 58.40 64.50 49.00
2006 65.10 60.40 58.80 64.90 49.00
2007 64.90 60.50 59.10 65.40 48.80
2008 64.90 60.30 59.20 65.70 49.10
2009 64.30 60.00 59.30 65.60 48.50
2010 63.50 60.10 59.30 65.60 48.20
2012 62.90 58.90 59.80 65.30 49.00
];%劳动参与率

x3=[ 
2002 12.49 12.49 12.00 12.57 12.50
2003 12.66 12.66 12.00 12.59 12.30
2004 12.68 12.68 12.10 12.40 11.50
2005 12.78 12.78 12.10 11.76 12.10
2006 12.83 12.83 12.20 11.74 12.00
2007 12.96 12.96 12.10 11.82 12.20
2008 13.09 13.09 12.20 11.87 12.50
2009 13.18 13.18 12.20 12.04 12.10
2010 13.29 13.29 12.30 12.34 11.30
2012 13.30 11.60 12.20 12.00 10.10
];%受教育年限

x4=[
2001 12.33 17.72 16.76 12.50 18.57
2002 12.30 18.24 17.28 12.61 18.88
2003 12.29 18.76 17.85 12.73 19.16
2004 12.30 19.29 18.42 12.83 19.42
2005 12.34 19.85 18.94 12.93 19.63
2006 12.42 20.42 19.42 13.01 19.78
2007 12.52 21.02 19.85 13.07 19.89
2008 12.66 21.64 20.23 13.15 19.99
2009 12.84 22.29 20.55 13.27 20.12
2010 13.06 22.96 20.81 13.45 20.29
2012 13.63 24.40 21.10 13.99 20.82
];%老龄化程度

%各国年龄、劳动参与率、受教育程度、老龄化程度平均值
Age=mean(x1,1);
Labor=mean(x2,1);
Education=mean(x3,1);
Old=mean(x4,1);

%美国年龄、劳动参与率、受教育程度、老龄化程度平均值
AmericanAge=Age(1,2);
AmericanLabor=Labor(1,2);
AmericanEducation=Education(1,2);
AmericanOld=Old(1,2);


%日本年龄、劳动参与率、受教育程度、老龄化程度平均值
JapanAge=Age(1,3);
JapanLabor=Labor(1,3);
JapanEducation=Education(1,3);
JapanOld=Old(1,3);

%德国年龄、劳动参与率、受教育程度、老龄化程度平均值
GermanyAge=Age(1,4);
GermanyLabor=Labor(1,4);
GermanyEducation=Education(1,4);
GermanyOld=Old(1,4);

%澳大利亚年龄、劳动参与率、受教育程度、老龄化程度平均值
AustraliaAge=Age(1,5);
AustraliaLabor=Labor(1,5);
AustraliaEducation=Education(1,5);
AustraliaOld=Old(1,5);


%澳大利亚年龄、劳动参与率、受教育程度、老龄化程度平均值
ItalyAge=Age(1,6);
ItalyLabor=Labor(1,6);
ItalyEducation=Education(1,6);
ItalyOld=Old(1,6);

%各国年龄平均值
A=[AmericanAge JapanAge GermanyAge AustraliaAge ItalyAge]';
%各国劳动力供求关系
L=[AmericanLabor JapanLabor GermanyLabor AustraliaLabor ItalyLabor]';
%各国教育水平
E=[AmericanEducation JapanEducation GermanyEducation AustraliaEducation ItalyEducation]';
%各国老龄化程度
O=[AmericanOld JapanOld GermanyOld AustraliaOld ItalyOld]';

A,L,E,O

x=[ones(5,1) A L E O];
y = [65 65 65 64 63]'; %赋值为不同国家的退休年龄

[b,bint,r,rint,stats]=regress(y,x); %对x2、x3、x1、x4进行回归
b %系数
bint %不同系数对应的置信区间
stats %得到检验统计量
p = b;
y=p(1)+p(2)*x1+p(3)*x2+p(4)*x3+p(5)*x4; %合理退休年限的回归方程



for x=2020:2040
    %我国国民预期寿命
    c1(x-2019) = 0.0027*x*x-10.589*x+10347;
    %我国劳动力供求关系
    c2(x-2019) = -0.0011*x*x+4.5116*x-4572.2;
    %我国受教育程度
    c3(x-2019) = 0.0004*x*x-1.586*x+1607.2;
    %我国人口老龄化程度
    c4(x-2019) = 0.0071*x*x-28.078*x+27947;
end

%预测我国未来二十年退休年龄
for i=1:20
    Y(i)=p(1)+p(2)*c1(i)+p(3)*c2(i)+p(4)*c3(i)+p(5)*c4(i);    
end 

for i=1:19
 t(i)=Y(i+1)-Y(i); %合理退休年龄的间隔
end
t;
T=mean(t); %找到合理退休年龄的平均间隔
v=var(y); %求出方差


