% x=0.1:0.01:0.18; 
% y=[42,41.5,45.0,45.5,45.0,47.5,49.0,55.0,50.0]; 
% plot(x,y,'+');



% clc,clear 
% x1=[0.1:0.01:0.18]'; 
% y=[42,41.5,45.0,45.5,45.0,47.5,49.0,55.0,50.0]'; 
% x=[ones(9,1),x1]; 
% [b,bint,r,rint,stats]=regress(y,x); 
% b,bint,stats,rcoplot(r,rint)

% clc,clear
% x1=[0.1,0.11,0.12,0.13,0.14,0.15,0.16,0.18]';
% y=[42,41.5,45.0,45.5,45.0,47.5,49.0,50.0]'; 
% x=[ones(8,1),x1]; 
% [b,bint,r,rint,stats]=regress(y,x); 
% b,bint,stats,rcoplot(r,rint)



% x0=17:2:29;
% x0=[x0,x0];
% 
% y0=[20.48,25.13,26.15,30.0,26.1,20.3,19.35,24.35,28.11,26.3,31.4,26.92,25.7,21.3];
% [p,s]=polyfit(x0,y0,2); 
% p
% [y,delta]=polyconf(p,x0,s);
% polytool(x0,y0,2)
% y

% x1=[120 140 190 130 155 175 125 145 180 150]'; 
% x2=[100 110 90 150 210 150 250 270 300 250]'; 
% y=[102 100 120 77 46 93 26 69 65 85]';
% 
% x=[x1 x2]; 
% rstool(x,y,'purequadratic')

% 
% clc,clear 
% a=[390.6,412,320,559.2, 380.8,542.4,553,310,561,300,632,540,406.2,313.8,576,587.6,318.5]'; 
% t0=find(a<=320); 
% t1=cumsum(t0);n=length(t1); 
% B=[-0.5*(t1(1:end-1)+t1(2:end)),ones(n-1,1)];Y=t0(2:end); 
% r=B\Y 
% y=dsolve('Dy+a*y=b','y(0)=y0'); 
% y=subs(y,{'a','b','y0'},{r(1),r(2),t1(1)}); 
% yuce1=subs(y,'t',[0:n+1]) 
% digits(6),y=vpa(y) %为提高预测精度，先计算预测值，再显示微分方程的解
% yuce=diff(yuce1); 
% yuce=[t0(1),yuce]






